StayEase/app/Http/Controllers/ChambreController.php

select * from `chambres`
---
    public function index()
    {


        $data = Chambre::all();

select * from `categories`
select * from `hotels`
select * from `tags`
select * from `proprietes`
---
    public function create()
    {



        return view('Chambre.add', [
            'hotel' => Hotel::all(),
            'Categorie' => Categorie::all(),
            'Tag' => Tag::all(),
            'Propriete' => Propriete::all()
        ]);

insert into `chambres` (`numero`, `description`, `image`, `statut`, `capacite`, `hotel_id`, `categorie_id`, `tag_id`, `propriete_id`, `updated_at`, `created_at`) values ('Est sint id reprehen', 'Harum qui et alias u', 'https://picsum.photos/400/300', 'Id dolorum nostrud t', '86', '1', '1', '1', '1', '2026-02-03 19:21:22', '2026-02-03 19:21:22')
---
    public function store(Request $request)
    {
        // dd($request);
        $validi = $request->validate([
            'numero' => 'required',
            'description' => 'required',
            'image' => 'required',
            'statut' => 'required',
            'capacite' => 'required',
            'hotel_id' => 'required',
            'categorie_id' => 'required',
            'tag_id' => 'required',
            'propriete_id' => 'required'
        ]);
        Chambre::create($validi);

select * from `categories`
select * from `hotels`
select * from `tags`
select * from `proprietes`
---
    public function edit(Chambre $Chambre)
    {

        return view('/Chambre.edit', [
            'hotel' => Hotel::all(),
            'Categorie' => Categorie::all(),
            'Tag' => Tag::all(),
            'Propriete' => Propriete::all(),
            'Chambre'=>$Chambre
        ]);

delete from `chambres` where `id` = 9
---
    public function destroy(Chambre $Chambre)
    {
        $Chambre->delete();